{
	"add_consumption":"Add food to consumption dictionary. Has to be two values per entry, amount and kind. Directly computes current consumption.",
	"add_dict_entry":"Adds new entry to the calory dictionary. Takes food, calories and amount as argument.",
	"BMI":"Computes BMI. Takes weight and height as argument.",
	"body_fat_percentage":"Computes body fat percentage. Takes height, abdomen and neck size as argument.",
	"change_consumption_entry":"Change consumption entry. Takes entry, amount of change and mode of change (add or multiply) as argument.",
	"change_user_data":"Change entry in the user data. Takes in key (weight, abdomen, etc.) and the change in value as an argument.",
	"compute_consumption":"Compute the current sum of the consumption dictionary.",
	"plot_BMI":"Plot development of BMI of the current year. Put in 0 as argument if you do not want the plot to be opened.",
	"plot_body_fat":"Plot development of body fat percentage of the current year. Put in 0 as argument if you do not want the plot to be opened.",
	"plot_consumption":"Plot the calory consumption of the current year including the current calory range. Put in 0 as argument if you do not want the plot to be opened.",
	"print_cal_demand":"Print the current calory range. Depending on the weight at age 25.",
	"print_consumption":"Print the current calory consumption dictionary.",
	"print_dict":"Prints out the calory dictionary. Takes food entries as arguments and prints them out. When no arguments are given it prints out the whole dictionary.",
	"print_user_data":"Prints out the user data.",
	"print_status":"Prints your current status, i.e. body mass index and body fat percentage.",
	"rm_consumption_entry":"Removes given entry from the calory consumption dictionary. Takes entry (food) as an argument 'all' as an argument removes the whole dictionary.",
	"rm_dict_entry":"Removes a given entry from the dictionary. Takes entry (food) as an argument.",
	"save_consumption":"Saves the calory consumption. If not for today put in date using 'yyyymmdd' as argument. Every seven days it updates data/measures.txt.",	
    "add_recipe":"Add a recipe to your data. Takes the name and a dictionary with key word and list with amount and unit as argument. Note that the dictionary also needs the key 'Zubereitung' with description.",
    "change_recipe":"Change the respective recipe. Takes name, changed amount and kind as an argument. More than one change at once is possible. To change 'Zubereitung' just type recipe name and new description.",
    "rm_recipe_entry":"Remove recipe entry. Takes name of the recipe and entry to remove as an argument.",  
    "print_recipe":"Prints out the recipe. Takes in the name of the recipe as argument.",
    "add_recipe_to_consumption":"Adds respective recipe to the consumption dictionary. Takes name as a argument as well as optionally changes (type in amount list and kind)."
}